Revit 2024 API
EnergyAnalysisDetailModel.Tier Property
 Level of computation for energy analysis model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public EnergyAnalysisDetailModelTier Tier { get; }
Visual Basic
Public ReadOnly Property Tier As EnergyAnalysisDetailModelTier
	Get
Visual C++
public:
property EnergyAnalysisDetailModelTier Tier {
	EnergyAnalysisDetailModelTier get ();
}
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace